{
    "text": "USA: Sept U.S. layoffs up from Aug but still low - report.\n        Sept U.S. layoffs up from Aug but still low - report.\n        NEW YORK 1996-10-07\n        U.S. layoffs rose last month, but spot labor shortages and fewer merger-related layoffs helped make September the second-lowest job-cuts month so far in 1996, said a report by Challenger, Gray & Christmas Inc.\n        Announced layoffs in September totaled 29,632, up 46 percent from August's 20,309 but down 10.7 percent from 33,173 in September 1995, the report said.\n        The August total was the lowest for any month since April 1995, it said.\n        \"For the past two months, spot labor shortages in some industries have helped to suppress the number of job cuts overall,\" said John Challenger, executive vice president at the international outplacement firm.\n        A decline in merger-related job cuts helped contain the overall number of layoffs as well, the report said.\n        In May through September 1996, six percent of total employee discharges were attributed to mergers, compared with 22 percent during the same period of 1995, it said.\n        Companies continue to trim their payrolls in order to keep wages under control, Challenger said.\n        \"Management views downsizing as a valve,\" he said. \"When the number of employees reaches a level that pushes against the wage ceiling, management turns the valve, discharging employees and relieving wage pressure.\"\n        The report said that for the first nine months of 1996, 8.3 percent of job cuts were merger-driven, compared with 13.6 percent a year earlier.\n        In the first nine months of 1996, 362,297 layoffs were announced, against 302,017 in the first nine months of 1995, the report said.\n        -- N.A. Treasury 212-859-1660\n        (c) Reuters Limited 1996",
    "shortText": "",
    "termVector": [],
    "language": {
        "lang": "en"
    },
    "entities": [],
    "mentions": [
        "ner",
        "wikipedia"
    ],
    "nbest": false,
    "sentence": false,
    "minSelectorScore": 0.2
}